Catalogs/ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодичностьОсмотра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериодичностиОсмотра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбследований</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Однократно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоответствиеПодтверждено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствующиеВредныеФакторы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВредныйФактор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыОбследований.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ВидыОбследований</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскийОсмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПсихиатрическоеОсвидетельствование</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		СпособПроведенияОсмотра = 1;
		// ЗУПК
		СобытияФормЗУПК.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		// ЗУПК
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ВидОсмотра",
		"Видимость",
		ПолучитьФункциональнуюОпцию("ИспользоватьПсихиатрическиеОсвидетельствования"));
	
	УстановитьВидимость(ЭтотОбъект);
	УстановитьЗаголовки(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ЗУПК
	СобытияФормЗУПК.ПриЧтенииНаСервере(ЭтаФорма);
	// ЗУПК
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВАрхиве Тогда
		// ЗУПК
		МедицинскиеОсмотрыФормыКлиент.ПроверитьИзменениеПериодичностиФактораВидаРабот(ЭтотОбъект, Отказ, ПараметрыЗаписи);
		// ЗУПК
	Иначе
		МедицинскиеОсмотрыФормыКлиент.ПроверитьИзменениеПериодичностиФактораВидаРабот(ЭтотОбъект, Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.ВАрхиве Тогда
		МедицинскиеОсмотрыФормы.УдалитьДублиФакторовВидовРабот(ТекущийОбъект.СоответствующиеВредныеФакторы, "ВредныйФактор");
	ИначеЕсли ТекущийОбъект.СоответствующиеВредныеФакторы.Количество() > 0 Тогда
		ТекущийОбъект.СоответствующиеВредныеФакторы.Очистить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиВредногоФактора();
	
	Если ЗакрыватьПослеЗаписи Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	
	Если Не ТекущийОбъект.ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Объект"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидОсмотраПриИзменении(Элемент)
	УстановитьЗаголовки(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПроводитсяОднократноПриИзменении(Элемент)
	
	УстановитьВидимостьПериодичности(ЭтотОбъект);
	СпособПроведенияОсмотраПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ВАрхивеПриИзменении(Элемент)
	УстановитьВидимостьСоответствия(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	
	ЗакрыватьПослеЗаписи = Истина;
	Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНеЗакрывать(Команда)
	
	ЗакрыватьПослеЗаписи = Ложь;
	Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект = Неопределено)
	
	МедицинскиеОсмотрыФормы.ПрочитатьОписаниеПериодичностиВредногоФактораВидаРабот(ЭтотОбъект, ТекущийОбъект);	
	
	Если ТекущийОбъект.Однократно Тогда
		СпособПроведенияОсмотра = 0;
	Иначе
		СпособПроведенияОсмотра = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИзменениеПериодичностиФактораВидаРаботПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЗаписи = Новый Структура("ПроверятьПериодичность", Истина);
	Если Результат.БольшеНеЗадаватьЭтотВопрос Тогда
		Объект.СоответствиеПодтверждено = Истина;
	КонецЕсли;
	
	МедицинскиеОсмотрыФормыКлиент.ПроверитьИзменениеПериодичностиФактораВидаРабот(ЭтотОбъект, Истина, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПослеВопроса(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.ОК Тогда
		Возврат;
	КонецЕсли;
	
	Записать(Новый Структура("ПроверятьПериодичность", Ложь));
	
КонецПроцедуры

&НаСервере
Процедура СпособПроведенияОсмотраПриИзменении()
	
	Объект.Однократно = СпособПроведенияОсмотра = 0;
	
	Если Объект.Однократно Тогда
		Объект.КратностьОсмотра = Неопределено;
		Объект.ПериодичностьОсмотра = Неопределено;
		Объект.ЕдиницаПериодичностиОсмотра = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимость(Форма)
	
	УстановитьВидимостьПериодичности(Форма);
	УстановитьВидимостьСоответствия(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьПериодичности(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Форма.Элементы, "ПериодичностьОсмотровГруппа", "Видимость", Форма.СпособПроведенияОсмотра = 1);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьСоответствия(Форма)
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
        // ЗУПК
		Форма.Элементы, "СоответствующиеАктуальныеВредныеФакторыГруппа", "Видимость", Ложь);
        // ЗУПК
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовки(Форма)
	
	Если Форма.Объект.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОбследований.МедицинскийОсмотр") Тогда
		Форма.Элементы.СоответствующиеАктуальныеВредныеФакторыГруппа.Заголовок =
			НСтр("ru = 'Соответствующие вредные факторы (виды работ) из приказа № 29н'");
		Форма.Элементы.ВАрхиве.Заголовок =
			НСтр("ru = 'Вредный фактор (вид деятельности) больше не используется'");
	ИначеЕсли Форма.Объект.ВидОсмотра = ПредопределенноеЗначение("Перечисление.ВидыОбследований.ПсихиатрическоеОсвидетельствование") Тогда
		Форма.Элементы.СоответствующиеАктуальныеВредныеФакторыГруппа.Заголовок =
			НСтр("ru = 'Соответствующие вредные факторы из приказа от 20.05.2022 № 342н'");
		Форма.Элементы.ВАрхиве.Заголовок =
			// ЗУПК
			НСтр("ru = 'Вредный фактор (вид деятельности) больше не используется'");
			// ЗУПК
	КонецЕсли;
	
КонецПроцедуры

#Область ДлительнаяОперация

&НаКлиенте
Процедура ЗакрытьФорму()
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьСКлиента() Экспорт
	
	ДлительнаяОперация = НачатьЗаписьДлительнойОперацией();
	Если ДлительнаяОперация = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ВыводитьСообщения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьЗаписьДлительнойОперацией", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаСервере
Функция НачатьЗаписьДлительнойОперацией()
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	СправочникОбъект = РеквизитФормыВЗначение("Объект");
	ДанныеОбъекта = ЗарплатаКадры.СериализоватьОбъектВДвоичныеДанные(СправочникОбъект);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Запись архивного вредного фактора (вида деятельности)'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"Справочники.ВредныеОпасныеПроизводственныеФакторыИВыполняемыеРаботы.ВыполнитьЗаписьОбъекта", ДанныеОбъекта);
	
КонецФункции

&НаКлиенте
Процедура ЗавершитьЗаписьДлительнойОперацией(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ВызватьИсключение Результат.КраткоеПредставлениеОшибки;
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	ЗаписьПослеВыполненияДлительнойОперацииНаСервере(Результат.АдресРезультата);
	
	ОповеститьОЗаписиВредногоФактора();
	
	Если ЗакрыватьПослеЗаписи Тогда
		ПодключитьОбработчикОжидания("ЗакрытьФорму", 0.1, Истина);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписьПослеВыполненияДлительнойОперацииНаСервере(АдресРезультата)
	
	ДанныеОбъекта = ПолучитьИзВременногоХранилища(АдресРезультата);
	ПрочитатьДанныеОбъектаВФорму(ЗарплатаКадры.ДесериализоватьОбъектИзДвоичныхДанных(ДанныеОбъекта));
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПрочитатьДанныеОбъектаВФорму(ТекущийОбъект)
	
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОЗаписиВредногоФактора()
	Оповестить("Запись_ВредныйФактор", Объект.Ссылка, ВладелецФормы);
КонецПроцедуры

#КонецОбласти
